{
    "name": "Leaflet Elementor Widget",
    "slug": "leaflet-elementor-widget",
    "author": "<a href='https://github.com/Joolace'>Joolace</a>",
    "author_profile": "https://github.com/Joolace",
    "donate_link": "https://github.com/Joolace",
    "version": "1.2.1",
    "download_url": "https://github.com/Joolace/leaflet-elementor/releases/download/1.2.6/leaflet-elementor-widget.zip",
    "requires": "6.3",
    "tested": "6.5.4",
    "requires_php": "8.0",
    "added": "2024-06-20 00:00:00",
    "last_updated": "2024-06-20 09:30:00",
    "homepage": "https://github.com/Joolace",
    "sections": {
        "description": "Leaflet Map.",
        "installation": "Un clic sul pulsante di attivazione e il gioco è fatto.",
        "changelog": "<h4>26/10/23</h4><ul><li>Bugfix: errore nella versione rilasciata (0.22).</li></ul><h4>25/10/23</h4><ul><li>Change: mera correzione estetica.</li></ul><h4>18/5/23 (Preview4)</h4><ul><li>Change: dismetto widget Firefox-Addons.</li></ul><h4>18/5/23 (Preview3)</h4><ul><li>Bugfix: correggo warning PHP <em>Undefined array key \"title\"</em>.</li></ul><h4>18/5/23 (Preview2)</h4><ul><li>Bugfix: (urgente) modifico funzione del widget Firefox-Addons perché contiene una API Key privata (ora invalidata).</li></ul><h4>17/5/23 (Preview1)</h4><ul><li>Change: aggiornamenti automatici integrati con il rilascio via Github.</li><li>Change: elimino il file di changelog vecchio e migro tutto il contenuto in questo JSON informativo.</li><li>Improvement: aggiungo icona personalizzata per il plugin.</li><li>Improvement: pulizia e ottimizzazione codice.</li><li>Immagine di copertina di <a href=\"https://unsplash.com/@dancristianpaduret?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Dan Cristian Pădureț</a> su <a href=\"https://unsplash.com/it/foto/noOXRT9gfQ8?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a>.</li></ul><h3>Archivio</h3><h4>2021</h4><ul><li>5/1/21 Wdg-Covid19: ho modificato l'icona degli articoli Covid-19.</li><li>24/1/21 Wdg-Covid19: ho incluso la possibilità di specificare quanti articoli caricare nel widget, fino a un massimo di 10.</li></ul><h4>2020</h4><ul><li>Wdg-BancoProva: propongo i link alle prove precedenti e agli ultimi acquisti fatti.</li><li>Wdg-Donazioni: standardizzo il widget in base agli altri creati per la sidebar di Gioxx.org</li><li>Wdg-BancoProva: metto a posto i link alle ultime banco prova / banco prova lampo (separandoli). Tolgo di mezzo tutto quanto, lascio solo il blocco relativo al Banco Prova e creo widget separati per le altre aree coperte.</li><li>Wdg-Evidenza: nuove modifiche CSS.</li><li>Wdg-Eventi: nuove modifiche CSS.</li><li>Wdg-Donazioni: nuove modifiche CSS.</li><li>Wdg-BancoProvaConsole: nuove modifiche CSS e nuovo metodo per integrare le news da gaming.gioxx.org (via rss2json).</li><li>Wdg-BancoProva: nuove modifiche CSS e imposto a 3 i banco prova / banco prova lampo nell'elenco puntato.</li><li>Wdg-Covid19: per riutilizzare il tag Covid-19 modifico la ricerca per mettere nella Sidebar solo gli articoli con Custom field \"covid19\" con valore \"sidebar\".</li><li>Wdg-Evidenza: modifico icona in evidenza.</li><li>Wdg-BancoProvaConsole: modifico puntamento RSS feed per cattura via rss2json.</li><li>Wdg-BancoProvaConsole: se il json delle notizie da Tumblr è vuoto, allora faccio sparire anche la dicitura che carico notizie dalla fonte esterna (modifica meramente estetica).</li><li>Wdg-FxAddons: nuovo widget che mi è utile richiamare tra le FAQ per la pagina Firefox Addons. Ha una porzione CSS dedicata per l'elenco delle notizie catturate in JSON dal feed privato di AMO.</li><li>Wdg-Evidenza: cambio icona In Evidenza e cambio anche lo stile dell'header del box.</li><li>Wdg-Eventi: cambio icona Eventi e cambio anche lo stile dell'header del box.</li><li>Wdg-Donazioni: cambio lo stile dell'header del box.</li><li>Wdg-BancoProvaConsole: cambio lo stile dell'header del box.</li><li>Wdg-BancoProva: cambio lo stile dell'header del box.</li></ul><h4>2019</h4><ul><li>Wdg-Donazioni: aggiungo collegamento a donazione con Satispay.</li><li>Wdg-RicercaGoogle (Deprecated): fix estetico.</li><li>Wdg-Facebook (Deprecated): fix estetico.</li><li>Wdg-Donazioni: fix estetico.</li><li>Wdg-BancoProva: fix estetico.</li><li>Wdg-BancoProva: sposto box \"in evidenza console\" sotto gli altri articoli in primo piano.</li><li>Wdg-Donazioni: metto a posto referral Amazon.</li></ul><h4>2018</h4><ul><li>Wdg-Donazioni: inserisco Patreon e BuyMeACoffee, sostituisco icone con fontawesome.</li><li>Wdg-Donazioni: messo a posto dettaglio estetico.</li><li>Wdg-Donazioni: corretto Buy Me A Coffee.</li><li>Wdg-Donazioni: aggiunto collegamento Amazon tra le possibili donazioni.</li><li>Wdg-RicercaGoogle (Deprecated): trasformazione in widget. Inserito ordine widget. Reintegro lista modifiche.</li><li>Wdg-Facebook (Deprecated): trasformazione in widget. Inserito ordine widget. Reintegro lista modifiche.</li><li>Wdg-Facebook (Deprecated): nascondo banner (fco + ShortPixel).</li><li>Wdg-Donazioni: trasformazione in widget. Inserito ordine widget. Reintegro lista modifiche.</li><li>Wdg-BancoProva: trasformazione in widget. Inserito ordine widget. Reintegro lista modifiche.</li><li>Wdg-Donazioni: piccolo dettaglio estetico (spaziatura tra elenco e testo prima).</li><li>Wdg-BancoProva: il box dedicato all'ultimo gioco recensito (ordine Wdg-BancoProva: copertina, titolo, estratto).</li></ul><h4>2017</h4><ul><li>Wdg-RicercaGoogle (Deprecated): puntamenti in HTTPS.</li><li>Wdg-Facebook (Deprecated): puntamenti in HTTPS.</li><li>Wdg-Donazioni: puntamenti in HTTPS.</li><li>Wdg-BancoProva: puntamenti in HTTPS.</li><li>Wdg-Donazioni: modifico il box per sostenere il blog.</li><li>Wdg-RicercaGoogle (Deprecated): modificata la ricerca, utilizza ora Google Custom Search.</li><li>Wdg-Facebook (Deprecated): ho commentato il \"Grazie a\" prima dei blocchi partner (immagini, sotto badge Facebook).</li></ul><h4>2016</h4><ul><li>Wdg-Facebook (Deprecated): aggiunto box like pagina Gioxx's Wall su Facebook</li><li>Wdg-Facebook (Deprecated): sostituzione blocco Fuorigio.co con box sponsorizzazioni</li><li>Wdg-Facebook (Deprecated): \"aggiustato\" box Facebook rotto (FbMerda v.0.1)</li></ul><h4>2015</h4><ul><li>Wdg-RicercaGoogle (Deprecated): integrato modulo di ricerca in cima alla Sidebar, puliti DIV inutili nei box custom.</li><li>Wdg-Donazioni: messo a posto collegamento PayPal.me</li><li>Wdg-Donazioni: modifica blocco donazioni, integrazione abbonamento PayPal</li><li>Wdg-Donazioni: aggiunta icona handshake per blocco donazioni</li></ul>"
    }
}